examples_3D_Simulations/6_3D_RM6_PTO_damping_high/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../flowParams"
#include "caseSetup_overset"

libs            (overset);

application     overInterDyMFoam;

startFrom		startTime;

startTime       $startTime;

stopAt          endTime;

endTime         $endTime;

writeControl    adjustableRunTime;

writeInterval   $writeVTK;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

deltaT          $maxDeltaT;

adjustTimeStep  yes;     // yes

maxCo           $maxCo;  // this is dominated by the nozzle // maybe we even do constant time step??

maxAlphaCo      $maxCo;

maxDeltaT       $maxDeltaT;

functions
{
    #include "waveProbes";
    #include "forces";
    #include "baffleFlux";
}


// ************************************************************************* //
